// تابع fadeIn که یک انیمیشن ورودی ایجاد می‌کند
export const fadeIn = (direction, delay) => {
  return {
    hidden: {
      // تنظیم موقعیت اولیه برای محور y بر اساس جهت
      y: direction === "up" ? 80 : direction === "down" ? -80 : 0,
      opacity: 0, // تنظیم شفافیت اولیه به 0 (ناپدید)
      // تنظیم موقعیت اولیه برای محور x بر اساس جهت
      x: direction === "left" ? 80 : direction === "right" ? -80 : 0,
    },
    show: {
      y: 0, // بازگشت به موقعیت اصلی در محور y
      x: 0, // بازگشت به موقعیت اصلی در محور x
      opacity: 1, // افزایش شفافیت به 1 (نمایش کامل)
      transition: {
        type: "tween", // نوع انتقال
        duration: 1.2, // مدت زمان انیمیشن
        delay: delay, // تاخیر شروع انیمیشن
        ease: [0.25, 0.25, 0.25, 0.75], // استفاده از تابع easing برای روان‌تر شدن انیمیشن
      },
    },
  };
};
